In [47]:
import pandas as pd

csv_path = "/Users/harrisongoodman/Downloads/sat-results.csv"

# âœ… Load the CSV
df = pd.read_csv(csv_path)

print("âœ… File loaded successfully!")
df.head()

âœ… File loaded successfully!

,DBN,SCHOOL NAME,Num of SAT Test Takers,SAT Critical Reading Avg. Score,SAT Math Avg. Score,SAT Writing Avg. Score,SAT Critical Readng Avg. Score,internal_school_id,contact_extension,pct_students_tested,academic_tier_rating
0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29,355,404,363,355,218160,x345,78%,2.0
1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91,383,423,366,383,268547,x234,NaN,3.0
2,01M450,EAST SIDE COMMUNITY SCHOOL,70,377,402,370,377,236446,x123,NaN,3.0
3,01M458,FORSYTH SATELLITE ACADEMY,7,414,401,359,414,427826,x123,92%,4.0
4,01M509,MARTA VALLE HIGH SCHOOL,44,390,433,384,390,672714,x123,92%,2.0

In [48]:
# Look at the first 5 rows
df.head()

,DBN,SCHOOL NAME,Num of SAT Test Takers,SAT Critical Reading Avg. Score,SAT Math Avg. Score,SAT Writing Avg. Score,SAT Critical Readng Avg. Score,internal_school_id,contact_extension,pct_students_tested,academic_tier_rating
0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29,355,404,363,355,218160,x345,78%,2.0
1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91,383,423,366,383,268547,x234,NaN,3.0
2,01M450,EAST SIDE COMMUNITY SCHOOL,70,377,402,370,377,236446,x123,NaN,3.0
3,01M458,FORSYTH SATELLITE ACADEMY,7,414,401,359,414,427826,x123,92%,4.0
4,01M509,MARTA VALLE HIGH SCHOOL,44,390,433,384,390,672714,x123,92%,2.0

In [8]:
# Show column names, non-null counts, and data types
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 493 entries, 0 to 492
Data columns (total 11 columns):
 #   Column                           Non-Null Count  Dtype
---  ------                           --------------  -----
 0   DBN                              493 non-null    object
 1   SCHOOL NAME                      493 non-null    object
 2   Num of SAT Test Takers           493 non-null    object
 3   SAT Critical Reading Avg. Score  493 non-null    object
 4   SAT Math Avg. Score              493 non-null    object
 5   SAT Writing Avg. Score           493 non-null    object
 6   SAT Critical Readng Avg. Score   493 non-null    object
 7   internal_school_id               493 non-null    int64
 8   contact_extension                388 non-null    object
 9   pct_students_tested              376 non-null    object
 10  academic_tier_rating             402 non-null    float64
dtypes: float64(1), int64(1), object(9)
memory usage: 42.5+ KB

In [9]:
# fixing column names
df.columns = df.columns.str.strip().str.lower().str.replace(' ', '_')

# Droping duplicated or typo column
df = df.drop(columns=['sat_critical_readng_avg._score'], errors='ignore')

df.head()

,dbn,school_name,num_of_sat_test_takers,sat_critical_reading_avg._score,sat_math_avg._score,sat_writing_avg._score,internal_school_id,contact_extension,pct_students_tested,academic_tier_rating
0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29,355,404,363,218160,x345,78%,2.0
1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91,383,423,366,268547,x234,NaN,3.0
2,01M450,EAST SIDE COMMUNITY SCHOOL,70,377,402,370,236446,x123,NaN,3.0
3,01M458,FORSYTH SATELLITE ACADEMY,7,414,401,359,427826,x123,92%,4.0
4,01M509,MARTA VALLE HIGH SCHOOL,44,390,433,384,672714,x123,92%,2.0

In [11]:
# Convert numeric columns from text to numbers
cols_to_convert = [
    'num_of_sat_test_takers',
    'sat_critical_reading_avg._score',
    'sat_math_avg._score',
    'sat_writing_avg._score'
]

for col in cols_to_convert:
    df[col] = pd.to_numeric(df[col], errors='coerce')

In [12]:
df.head()

,dbn,school_name,num_of_sat_test_takers,sat_critical_reading_avg._score,sat_math_avg._score,sat_writing_avg._score,internal_school_id,contact_extension,pct_students_tested,academic_tier_rating
0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29.0,355.0,404.0,363.0,218160,x345,78%,2.0
1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91.0,383.0,423.0,366.0,268547,x234,NaN,3.0
2,01M450,EAST SIDE COMMUNITY SCHOOL,70.0,377.0,402.0,370.0,236446,x123,NaN,3.0
3,01M458,FORSYTH SATELLITE ACADEMY,7.0,414.0,401.0,359.0,427826,x123,92%,4.0
4,01M509,MARTA VALLE HIGH SCHOOL,44.0,390.0,433.0,384.0,672714,x123,92%,2.0

In [13]:
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 493 entries, 0 to 492
Data columns (total 10 columns):
 #   Column                           Non-Null Count  Dtype
---  ------                           --------------  -----
 0   dbn                              493 non-null    object
 1   school_name                      493 non-null    object
 2   num_of_sat_test_takers           435 non-null    float64
 3   sat_critical_reading_avg._score  435 non-null    float64
 4   sat_math_avg._score              435 non-null    float64
 5   sat_writing_avg._score           435 non-null    float64
 6   internal_school_id               493 non-null    int64
 7   contact_extension                388 non-null    object
 8   pct_students_tested              376 non-null    object
 9   academic_tier_rating             402 non-null    float64
dtypes: float64(5), int64(1), object(4)
memory usage: 38.6+ KB

,num_of_sat_test_takers,sat_critical_reading_avg._score,sat_math_avg._score,sat_writing_avg._score,internal_school_id,academic_tier_rating
count,435.000000,435.000000,435.000000,435.000000,493.000000,402.000000
mean,111.402299,400.712644,417.643678,393.712644,562172.943205,2.564677
std,154.806216,56.056774,86.991283,57.870447,262138.627055,1.126443
min,6.000000,279.000000,-10.000000,286.000000,101855.000000,1.000000
25%,42.000000,368.000000,372.000000,360.000000,332013.000000,2.000000
50%,63.000000,391.000000,396.000000,382.000000,587220.000000,3.000000
75%,97.500000,416.000000,438.000000,411.000000,782993.000000,4.000000
max,1277.000000,679.000000,1100.000000,682.000000,999398.000000,4.000000

In [53]:
import pandas as pd

# Ensure all values are strings before using .str methods
df['pct_students_tested'] = (
    df['pct_students_tested']
    .astype(str)                         # convert everything to string first to guarantee easy conversion from 'percent' to 'numeric' as you suggested.
    .str.replace('%', '', regex=False)   # removes % sign
)

# Now convert to numeric (turns missing entries into NaN)
df['pct_students_tested'] = pd.to_numeric(df['pct_students_tested'], errors='coerce')

In [57]:
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 493 entries, 0 to 492
Data columns (total 11 columns):
 #   Column                           Non-Null Count  Dtype
---  ------                           --------------  -----
 0   DBN                              493 non-null    object
 1   SCHOOL NAME                      493 non-null    object
 2   Num of SAT Test Takers           493 non-null    object
 3   SAT Critical Reading Avg. Score  493 non-null    object
 4   SAT Math Avg. Score              493 non-null    object
 5   SAT Writing Avg. Score           493 non-null    object
 6   SAT Critical Readng Avg. Score   493 non-null    object
 7   internal_school_id               493 non-null    int64
 8   contact_extension                388 non-null    object
 9   pct_students_tested              376 non-null    float64
 10  academic_tier_rating             402 non-null    float64
dtypes: float64(2), int64(1), object(8)
memory usage: 42.5+ KB

       internal_school_id  pct_students_tested  academic_tier_rating
count          493.000000           376.000000            402.000000
mean        562172.943205            84.683511              2.564677
std         262138.627055             5.718120              1.126443
min         101855.000000            78.000000              1.000000
25%         332013.000000            78.000000              2.000000
50%         587220.000000            85.000000              3.000000
75%         782993.000000            92.000000              4.000000
max         999398.000000            92.000000              4.000000

In [58]:
df.head()

,DBN,SCHOOL NAME,Num of SAT Test Takers,SAT Critical Reading Avg. Score,SAT Math Avg. Score,SAT Writing Avg. Score,SAT Critical Readng Avg. Score,internal_school_id,contact_extension,pct_students_tested,academic_tier_rating
0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29,355,404,363,355,218160,x345,78.0,2.0
1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91,383,423,366,383,268547,x234,NaN,3.0
2,01M450,EAST SIDE COMMUNITY SCHOOL,70,377,402,370,377,236446,x123,NaN,3.0
3,01M458,FORSYTH SATELLITE ACADEMY,7,414,401,359,414,427826,x123,92.0,4.0
4,01M509,MARTA VALLE HIGH SCHOOL,44,390,433,384,390,672714,x123,92.0,2.0

In [15]:
# Fill missing text values
df['contact_extension'] = df['contact_extension'].fillna("Unknown")

# Fill missing numeric values
numeric_cols_mean = [
    'num_of_sat_test_takers',
    'sat_critical_reading_avg._score',
    'sat_math_avg._score',
    'sat_writing_avg._score',
    'pct_students_tested',
    'academic_tier_rating'
]

for col in numeric_cols_mean:
    df[col] = pd.to_numeric(df[col], errors='coerce')
    df[col].fillna(df[col].mean(), inplace=True)

# Confirm there are no missing values now
df.isnull().sum()

/var/folders/gv/c1xdc57121nf6l68nrddnzwm0000gn/T/ipykernel_40971/1875279025.py:16: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df[col].fillna(df[col].mean(), inplace=True)

dbn                                  0
school_name                          0
num_of_sat_test_takers               0
sat_critical_reading_avg._score      0
sat_math_avg._score                  0
sat_writing_avg._score               0
internal_school_id                   0
contact_extension                    0
pct_students_tested                493
academic_tier_rating                 0
dtype: int64

In [18]:
sat_cols = ['sat_critical_reading_avg._score', 'sat_math_avg._score', 'sat_writing_avg._score']

for col in sat_cols:
    df.loc[(df[col] < 200) | (df[col] > 800), col] = None  # replace invalid scores with NaN

In [19]:
for col in sat_cols:
    df[col].fillna(df[col].mean(), inplace=True)

/var/folders/gv/c1xdc57121nf6l68nrddnzwm0000gn/T/ipykernel_40971/387483980.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df[col].fillna(df[col].mean(), inplace=True)

In [69]:
from sqlalchemy import create_engine, text

# Connect to your database
engine = create_engine(
    'postgresql+psycopg2://neondb_owner:a9Am7Yy5r9_T7h4OF2GN@ep-falling-glitter-a5m0j5gk-pooler.us-east-2.aws.neon.tech/neondb'
)

# Run the ALTER TABLE command
with engine.begin() as conn:
    conn.execute(text("""
        ALTER TABLE harrison_sat_scores
        ADD COLUMN IF NOT EXISTS pct_students_tested FLOAT;
    """))

print("âœ… Column 'pct_students_tested' added (or already exists).")

âœ… Column 'pct_students_tested' added (or already exists).

In [79]:
from sqlalchemy import create_engine, text
import pandas as pd

# Connect to PostgreSQL
engine = create_engine(
    'postgresql+psycopg2://neondb_owner:a9Am7Yy5r9_T7h4OF2GN@ep-falling-glitter-a5m0j5gk-pooler.us-east-2.aws.neon.tech/neondb'
)

# --- 1. Import required libraries ---
import pandas as pd
from sqlalchemy import create_engine, text

# --- 2. Load your CSV or existing df (assuming df is already in memory) ---
# If not, uncomment and replace the path below:
# df = pd.read_csv("your_file.csv")

# --- 3. Clean column names to a consistent format ---
df.columns = (
    df.columns.str.strip()
              .str.lower()
              .str.replace(' ', '_')
              .str.replace('.', '', regex=False)
)

# --- 4. Clean pct_students_tested: remove '%' and convert to numeric ---
df['pct_students_tested'] = (
    df['pct_students_tested']
      .astype(str)                          # convert to string
      .str.replace('%', '', regex=False)    # remove percent sign
)

df['pct_students_tested'] = pd.to_numeric(df['pct_students_tested'], errors='coerce')

# Optional: if you want proportions (e.g. 78 â†’ 0.78)
# df['pct_students_tested'] = df['pct_students_tested'] / 100

# --- 5. Connect to your PostgreSQL database ---
engine = create_engine(
    'postgresql+psycopg2://neondb_owner:a9Am7Yy5r9_T7h4OF2GN@ep-falling-glitter-a5m0j5gk-pooler.us-east-2.aws.neon.tech/neondb'
)

# --- 6. Drop the table if it already exists (clean rebuild) ---
with engine.begin() as conn:
    conn.execute(text("DROP TABLE IF EXISTS harrison_sat_scores;"))

# --- 7. Create the new table directly from df ---
# This ensures the schema matches exactly your DataFrame
df.to_sql('harrison_sat_scores', engine, if_exists='replace', index=False)

print("âœ… Database table 'harrison_sat_scores' successfully rebuilt and populated!")

# --- 8. (Optional) Verify table creation ---
with engine.connect() as conn:
    result = conn.execute(text("""
        SELECT column_name, data_type
        FROM information_schema.columns
        WHERE table_name = 'harrison_sat_scores';
    """))
    cols = result.fetchall()
    print("\nðŸ§¾ Table structure:")
    for name, dtype in cols:
        print(f"  - {name}: {dtype}")

print("\nðŸŽ‰ All data inserted successfully with matching schema!")

âœ… Database table 'harrison_sat_scores' successfully rebuilt and populated!

ðŸ§¾ Table structure:
  - dbn: text
  - school_name: text
  - num_of_sat_test_takers: text
  - internal_school_id: bigint
  - contact_extension: text
  - pct_students_tested: double precision
  - academic_tier_rating: double precision

ðŸŽ‰ All data inserted successfully with matching schema!

In [85]:
import pandas as pd
from sqlalchemy import create_engine, text

# --- 1ï¸âƒ£ Connect to your database ---
engine = create_engine(
    'postgresql+psycopg2://neondb_owner:a9Am7Yy5r9_T7h4OF2GN@ep-falling-glitter-a5m0j5gk-pooler.us-east-2.aws.neon.tech/neondb'
)

# --- 2ï¸âƒ£ Load or prepare your DataFrame ---
# Example: replace with your CSV file if needed
# df = pd.read_csv("your_file.csv")

# If you already have df loaded in your notebook, skip this line

# --- 3ï¸âƒ£ Clean column names ---
df.columns = (
    df.columns.str.strip()
              .str.lower()
              .str.replace(' ', '_')
              .str.replace('.', '', regex=False)
)

# --- 4ï¸âƒ£ Clean pct_students_tested ---
df['pct_students_tested'] = (
    df['pct_students_tested']
      .astype(str)
      .str.replace('%', '', regex=False)
)

df['pct_students_tested'] = pd.to_numeric(df['pct_students_tested'], errors='coerce')

# --- 5ï¸âƒ£ Drop and rebuild the table cleanly ---
with engine.begin() as conn:
    conn.execute(text("DROP TABLE IF EXISTS harrison_sat_scores;"))

# Create the table based on DataFrame schema
df.head(0).to_sql('harrison_sat_scores', engine, if_exists='replace', index=False)

print("âœ… Table 'harrison_sat_scores' created successfully!")

# --- 6ï¸âƒ£ Parameterized Insert Example ---
with engine.begin() as conn:
    
    insert_query = text("""
    INSERT INTO harrison_sat_scores (
        dbn,
        school_name,
        num_of_sat_test_takers,
        internal_school_id,
        contact_extension,
        pct_students_tested,
        academic_tier_rating
    )
    VALUES (
        :dbn,
        :school_name,
        :num_of_sat_test_takers,
        :internal_school_id,
        :contact_extension,
        :pct_students_tested,
        :academic_tier_rating
    )
""")

    # Example record insert (you can loop through df rows if needed)
    conn.execute(insert_query, {
        "dbn": "01M292",
        "school_name": "Sample High School",
        "num_of_sat_test_takers": 120.0,
        "internal_school_id": 292,
        "contact_extension": "1234",
        "pct_students_tested": 78.0,
        "academic_tier_rating": 2.0
    })

print("ðŸŽ‰ Parameterized insert and commit logic demonstrated successfully!")

âœ… Table 'harrison_sat_scores' created successfully!
ðŸŽ‰ Parameterized insert and commit logic demonstrated successfully!

In [86]:
import os

# Create folder if it doesn't exist
os.makedirs("daily_tasks/day_4", exist_ok=True)

# Now save the CSV
df.to_csv("daily_tasks/day_4/cleaned_sat_results.csv", index=False)
print("âœ… Cleaned CSV saved successfully!")

âœ… Cleaned CSV saved successfully!